Autodesk.Revit.DB.PrintSetting.updateCachePrintParameters
Returns the Name of Print Setup.

Autodesk.Revit.DB.PrintSetting.PrintParameters
Returns the Parameters of Print Setup.
Remarks: The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.

Autodesk.Revit.DB.PrintSetting.Name
Returns the Name of Print Setup.
valueString:  The Name you want to set to Print Setup.
Remarks: Retrieve/set the name of Print Setup.

Autodesk.Revit.DB.PrintSetting
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.